bezier_coanda/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(-3.0 0.0 -0.078)	//	0
		(-3.0 0.0 0.078)	//	1
		(-0.06695202820334574 -3.0 -0.078)	//	2
		(-0.06695202820334574 -3.0 0.078)	//	3
		(-0.3 0.0 -0.078)	//	4
		(-0.3 0.0 0.078)	//	5
		(-0.021398036986015834 0.004281029886492273 -0.078)	//	6
		(-0.021398036986015834 0.004281029886492273 0.078)	//	7
		(-0.021398036986015834 3.0 -0.078)	//	8
		(-0.021398036986015834 3.0 0.078)	//	9
		(-0.003553 3.0 -0.078)	//	10
		(-0.003553 3.0 0.078)	//	11
		(2.996444 0.0 -0.078)	//	12
		(2.996444 0.0 0.078)	//	13
		(-0.003553 -3.0 -0.078)	//	14
		(-0.003553 -3.0 0.078)	//	15
		(0.0 0.0 -0.078)	//	16
		(0.0 0.0 0.078)	//	17
		(-0.06695202820334574 -0.004416686957117152 -0.078)	//	18
		(-0.06695202820334574 -0.004416686957117152 0.078)	//	19
		(0.0 0.0 -0.078)	//	20
		(0.0 0.0 0.078)	//	21
		(-0.003556 0.003556 -0.078)	//	22
		(-0.003556 0.003556 0.078)	//	23
		(-0.003555 0.0037846 -0.078)	//	24
		(-0.003555 0.0037846 0.078)	//	25
		(-0.0035540000000000003 0.0040132 -0.078)	//	26
		(-0.0035540000000000003 0.0040132 0.078)	//	27
		(-0.021398036986015834 0.004281029886492273 -0.078)	//	28
		(-0.021398036986015834 0.004281029886492273 0.078)	//	29
		(-0.003556 -0.003556 -0.078)	//	30
		(-0.003556 -0.003556 0.078)	//	31
		(-0.003555 -0.0037846 -0.078)	//	32
		(-0.003555 -0.0037846 0.078)	//	33
		(-0.0035540000000000003 -0.0040132 -0.078)	//	34
		(-0.0035540000000000003 -0.0040132 0.078)	//	35
		(-0.06695202820334574 -0.004416686957117152 -0.078)	//	36
		(-0.06695202820334574 -0.004416686957117152 0.078)	//	37
);

blocks
(
		hex ( 4 28  8  0  5 29  9  1) (120 40 1) edgeGrading (5 1 1 5 1000 1000 1000 1000 1 1 1 1) // 0
		hex (28 26 10  8 29 27 11  9) (25 40 1) simpleGrading (0.1  1000  1) // 1
		hex (26 34 14 10 27 35 15 11) (60 40 1) simpleGrading ( 1  1000  1) // 2
		hex (34 36  2 14 35 37  3 15) (25 40 1) simpleGrading (10  1000  1) // 3
		hex (36  4  0  2 37  5  1  3) (120 40 1) edgeGrading (.2 1 1 .2 1000 1000 1000 1000 1 1 1 1) // 4
		hex (24 32 34 26 25 33 35 27) (60 2 1) simpleGrading ( 1  1  1) // 5
		hex (22 30 32 24 23 31 33 25) (60 2 1) simpleGrading ( 1  1  1) // 6
);

edges
(
		arc  8  0  90.0  (0 0 1)
		arc  9  1  90.0  (0 0 1)
		arc  0  2  90.0  (0 0 1)
		arc  1  3  90.0  (0 0 1)
		arc 14 10 180.0  (0 0 1)
		arc 15 11 180.0  (0 0 1)
		arc 30 22 180.0  (0 0 1)
		arc 31 23 180.0  (0 0 1)
		arc 32 24 180.0  (0 0 1)
		arc 33 25 180.0  (0 0 1)
		arc 34 26 180.0  (0 0 1)
		arc 35 27 180.0  (0 0 1)
		spline 4 28 (
							(-0.29989081  0.00084111 -0.078     )
							(-0.29957233  0.0016444  -0.078     )
							(-0.29905775  0.00241181 -0.078     )
							(-0.29835963  0.00314519 -0.078     )
							(-0.29748997  0.00384633 -0.078     )
							(-0.29646018  0.00451694 -0.078     )
							(-0.29528111  0.00515866 -0.078     )
							(-0.29396308  0.00577307 -0.078     )
							(-0.29251586  0.00636167 -0.078     )
							(-0.29094874  0.0069259  -0.078     )
							(-0.28927049  0.00746711 -0.078     )
							(-0.28748938  0.00798662 -0.078     )
							(-0.28561324  0.00848566 -0.078     )
							(-0.28364943  0.0089654  -0.078     )
							(-0.28160487  0.00942694 -0.078     )
							(-0.27948605  0.00987132 -0.078     )
							(-0.27729905  0.01029953 -0.078     )
							(-0.27504954  0.01071249 -0.078     )
							(-0.27274282  0.01111105 -0.078     )
							(-0.2703838   0.01149602 -0.078     )
							(-0.26797704  0.01186812 -0.078     )
							(-0.26552673  0.01222806 -0.078     )
							(-0.26303675  0.01257645 -0.078     )
							(-0.26051064  0.01291387 -0.078     )
							(-0.25795165  0.01324084 -0.078     )
							(-0.25536271  0.01355782 -0.078     )
							(-0.25274647  0.01386523 -0.078     )
							(-0.25010532  0.01416343 -0.078     )
							(-0.24744136  0.01445273 -0.078     )
							(-0.24475646  0.01473341 -0.078     )
							(-0.24205226  0.01500567 -0.078     )
							(-0.23933014  0.0152697  -0.078     )
							(-0.23659129  0.01552563 -0.078     )
							(-0.23383669  0.01577354 -0.078     )
							(-0.23106711  0.01601347 -0.078     )
							(-0.22828316  0.01624543 -0.078     )
							(-0.22548527  0.01646938 -0.078     )
							(-0.22267369  0.01668526 -0.078     )
							(-0.21984853  0.01689295 -0.078     )
							(-0.21700976  0.0170923  -0.078     )
							(-0.21415722  0.01728315 -0.078     )
							(-0.21129061  0.01746528 -0.078     )
							(-0.20840954  0.01763845 -0.078     )
							(-0.2055135   0.01780239 -0.078     )
							(-0.20260189  0.01795681 -0.078     )
							(-0.19967403  0.01810138 -0.078     )
							(-0.19672916  0.01823575 -0.078     )
							(-0.19376645  0.01835956 -0.078     )
							(-0.19078501  0.01847242 -0.078     )
							(-0.18778392  0.01857391 -0.078     )
							(-0.18476219  0.0186636  -0.078     )
							(-0.18171881  0.01874105 -0.078     )
							(-0.17865275  0.0188058  -0.078     )
							(-0.17556296  0.01885737 -0.078     )
							(-0.17244838  0.01889529 -0.078     )
							(-0.16930793  0.01891905 -0.078     )
							(-0.16614058  0.01892815 -0.078     )
							(-0.16294527  0.01892209 -0.078     )
							(-0.15972097  0.01890036 -0.078     )
							(-0.1564667   0.01886244 -0.078     )
							(-0.15318148  0.0188078  -0.078     )
							(-0.14986441  0.01873595 -0.078     )
							(-0.1465146   0.01864637 -0.078     )
							(-0.14313123  0.01853856 -0.078     )
							(-0.13971354  0.018412   -0.078     )
							(-0.13626085  0.01826623 -0.078     )
							(-0.13277252  0.01810074 -0.078     )
							(-0.12924802  0.01791509 -0.078     )
							(-0.12568688  0.01770882 -0.078     )
							(-0.12208874  0.01748149 -0.078     )
							(-0.1184533   0.01723268 -0.078     )
							(-0.11478041  0.01696201 -0.078     )
							(-0.11106998  0.01666911 -0.078     )
							(-0.10732204  0.01635361 -0.078     )
							(-0.10353675  0.01601522 -0.078     )
							(-0.09971438  0.01565363 -0.078     )
							(-0.09585532  0.01526858 -0.078     )
							(-0.09196008  0.01485986 -0.078     )
							(-0.08802931  0.01442728 -0.078     )
							(-0.0840638   0.01397068 -0.078     )
							(-0.08006448  0.01348996 -0.078     )
							(-0.0760324   0.01298504 -0.078     )
							(-0.07196877  0.0124559  -0.078     )
							(-0.06787496  0.01190258 -0.078     )
							(-0.06375249  0.01132514 -0.078     )
							(-0.05960301  0.01072372 -0.078     )
							(-0.05542835  0.01009848 -0.078     )
							(-0.05123051  0.00944967 -0.078     )
							(-0.04701163  0.00877759 -0.078     )
							(-0.04277402  0.0080826  -0.078     )
							(-0.03852017  0.00736511 -0.078     )
							(-0.03425274  0.00662561 -0.078     )
							(-0.02997454  0.00586467 -0.078     )
							(-0.02568858  0.00508291 -0.078     )

						)
		spline 4 36 (
							(-0.29988723 -0.00077516 -0.078     )
							(-0.29955884 -0.00152527 -0.078     )
							(-0.29902916 -0.00225135 -0.078     )
							(-0.29831185 -0.00295437 -0.078     )
							(-0.29741992 -0.00363524 -0.078     )
							(-0.29636574 -0.00429481 -0.078     )
							(-0.29516105 -0.00493389 -0.078     )
							(-0.293817   -0.00555323 -0.078     )
							(-0.29234414 -0.00615354 -0.078     )
							(-0.29075244 -0.00673546 -0.078     )
							(-0.28905134 -0.00729959 -0.078     )
							(-0.28724971 -0.00784648 -0.078     )
							(-0.28535593 -0.00837664 -0.078     )
							(-0.28337783 -0.00889052 -0.078     )
							(-0.28132278 -0.00938853 -0.078     )
							(-0.27919768 -0.00987104 -0.078     )
							(-0.27700893 -0.01033836 -0.078     )
							(-0.27476252 -0.01079078 -0.078     )
							(-0.272464   -0.01122852 -0.078     )
							(-0.27011848 -0.01165178 -0.078     )
							(-0.26773071 -0.01206072 -0.078     )
							(-0.26530502 -0.01245545 -0.078     )
							(-0.26284538 -0.01283606 -0.078     )
							(-0.2603554  -0.01320258 -0.078     )
							(-0.25783834 -0.01355504 -0.078     )
							(-0.25529714 -0.0138934  -0.078     )
							(-0.2527344  -0.01421763 -0.078     )
							(-0.25015244 -0.01452763 -0.078     )
							(-0.24755327 -0.01482331 -0.078     )
							(-0.24493865 -0.01510452 -0.078     )
							(-0.24231004 -0.01537111 -0.078     )
							(-0.23966866 -0.0156229  -0.078     )
							(-0.23701551 -0.0158597  -0.078     )
							(-0.23435133 -0.01608127 -0.078     )
							(-0.23167667 -0.01628739 -0.078     )
							(-0.22899186 -0.01647781 -0.078     )
							(-0.22629705 -0.01665226 -0.078     )
							(-0.2235922  -0.01681048 -0.078     )
							(-0.22087712 -0.01695219 -0.078     )
							(-0.21815143 -0.01707709 -0.078     )
							(-0.21541465 -0.0171849  -0.078     )
							(-0.21266611 -0.01727532 -0.078     )
							(-0.20990507 -0.01734807 -0.078     )
							(-0.20713064 -0.01740286 -0.078     )
							(-0.20434184 -0.01743941 -0.078     )
							(-0.2015376  -0.01745744 -0.078     )
							(-0.19871675 -0.01745669 -0.078     )
							(-0.19587808 -0.01743691 -0.078     )
							(-0.19302028 -0.01739786 -0.078     )
							(-0.19014201 -0.01733933 -0.078     )
							(-0.18724188 -0.01726113 -0.078     )
							(-0.18431846 -0.01716308 -0.078     )
							(-0.18137031 -0.01704504 -0.078     )
							(-0.17839596 -0.0169069  -0.078     )
							(-0.17539392 -0.01674857 -0.078     )
							(-0.17236273 -0.01657    -0.078     )
							(-0.16930092 -0.0163712  -0.078     )
							(-0.16620703 -0.01615218 -0.078     )
							(-0.16307965 -0.01591304 -0.078     )
							(-0.15991738 -0.01565389 -0.078     )
							(-0.15671888 -0.01537491 -0.078     )
							(-0.15348283 -0.01507633 -0.078     )
							(-0.15020798 -0.01475844 -0.078     )
							(-0.14689317 -0.01442158 -0.078     )
							(-0.14353726 -0.01406618 -0.078     )
							(-0.14013922 -0.0136927  -0.078     )
							(-0.13669809 -0.01330171 -0.078     )
							(-0.133213   -0.01289382 -0.078     )
							(-0.12968319 -0.01246973 -0.078     )
							(-0.12610798 -0.01203025 -0.078     )
							(-0.1224868  -0.01157622 -0.078     )
							(-0.11881922 -0.01110862 -0.078     )
							(-0.1151049  -0.01062849 -0.078     )
							(-0.11134363 -0.01013699 -0.078     )
							(-0.10753535 -0.00963536 -0.078     )
							(-0.1036801  -0.00912496 -0.078     )
							(-0.09977809 -0.00860724 -0.078     )
							(-0.09582965 -0.00808379 -0.078     )
							(-0.09183529 -0.00755629 -0.078     )
							(-0.08779565 -0.00702656 -0.078     )
							(-0.08371153 -0.00649652 -0.078     )
							(-0.07958389 -0.00596825 -0.078     )
							(-0.07541387 -0.00544394 -0.078     )
							(-0.07120275 -0.00492593 -0.078     )

						)
		spline 5 29 (
							(-0.29989081  0.00084111  0.078     )
							(-0.29957233  0.0016444   0.078     )
							(-0.29905775  0.00241181  0.078     )
							(-0.29835963  0.00314519  0.078     )
							(-0.29748997  0.00384633  0.078     )
							(-0.29646018  0.00451694  0.078     )
							(-0.29528111  0.00515866  0.078     )
							(-0.29396308  0.00577307  0.078     )
							(-0.29251586  0.00636167  0.078     )
							(-0.29094874  0.0069259   0.078     )
							(-0.28927049  0.00746711  0.078     )
							(-0.28748938  0.00798662  0.078     )
							(-0.28561324  0.00848566  0.078     )
							(-0.28364943  0.0089654   0.078     )
							(-0.28160487  0.00942694  0.078     )
							(-0.27948605  0.00987132  0.078     )
							(-0.27729905  0.01029953  0.078     )
							(-0.27504954  0.01071249  0.078     )
							(-0.27274282  0.01111105  0.078     )
							(-0.2703838   0.01149602  0.078     )
							(-0.26797704  0.01186812  0.078     )
							(-0.26552673  0.01222806  0.078     )
							(-0.26303675  0.01257645  0.078     )
							(-0.26051064  0.01291387  0.078     )
							(-0.25795165  0.01324084  0.078     )
							(-0.25536271  0.01355782  0.078     )
							(-0.25274647  0.01386523  0.078     )
							(-0.25010532  0.01416343  0.078     )
							(-0.24744136  0.01445273  0.078     )
							(-0.24475646  0.01473341  0.078     )
							(-0.24205226  0.01500567  0.078     )
							(-0.23933014  0.0152697   0.078     )
							(-0.23659129  0.01552563  0.078     )
							(-0.23383669  0.01577354  0.078     )
							(-0.23106711  0.01601347  0.078     )
							(-0.22828316  0.01624543  0.078     )
							(-0.22548527  0.01646938  0.078     )
							(-0.22267369  0.01668526  0.078     )
							(-0.21984853  0.01689295  0.078     )
							(-0.21700976  0.0170923   0.078     )
							(-0.21415722  0.01728315  0.078     )
							(-0.21129061  0.01746528  0.078     )
							(-0.20840954  0.01763845  0.078     )
							(-0.2055135   0.01780239  0.078     )
							(-0.20260189  0.01795681  0.078     )
							(-0.19967403  0.01810138  0.078     )
							(-0.19672916  0.01823575  0.078     )
							(-0.19376645  0.01835956  0.078     )
							(-0.19078501  0.01847242  0.078     )
							(-0.18778392  0.01857391  0.078     )
							(-0.18476219  0.0186636   0.078     )
							(-0.18171881  0.01874105  0.078     )
							(-0.17865275  0.0188058   0.078     )
							(-0.17556296  0.01885737  0.078     )
							(-0.17244838  0.01889529  0.078     )
							(-0.16930793  0.01891905  0.078     )
							(-0.16614058  0.01892815  0.078     )
							(-0.16294527  0.01892209  0.078     )
							(-0.15972097  0.01890036  0.078     )
							(-0.1564667   0.01886244  0.078     )
							(-0.15318148  0.0188078   0.078     )
							(-0.14986441  0.01873595  0.078     )
							(-0.1465146   0.01864637  0.078     )
							(-0.14313123  0.01853856  0.078     )
							(-0.13971354  0.018412    0.078     )
							(-0.13626085  0.01826623  0.078     )
							(-0.13277252  0.01810074  0.078     )
							(-0.12924802  0.01791509  0.078     )
							(-0.12568688  0.01770882  0.078     )
							(-0.12208874  0.01748149  0.078     )
							(-0.1184533   0.01723268  0.078     )
							(-0.11478041  0.01696201  0.078     )
							(-0.11106998  0.01666911  0.078     )
							(-0.10732204  0.01635361  0.078     )
							(-0.10353675  0.01601522  0.078     )
							(-0.09971438  0.01565363  0.078     )
							(-0.09585532  0.01526858  0.078     )
							(-0.09196008  0.01485986  0.078     )
							(-0.08802931  0.01442728  0.078     )
							(-0.0840638   0.01397068  0.078     )
							(-0.08006448  0.01348996  0.078     )
							(-0.0760324   0.01298504  0.078     )
							(-0.07196877  0.0124559   0.078     )
							(-0.06787496  0.01190258  0.078     )
							(-0.06375249  0.01132514  0.078     )
							(-0.05960301  0.01072372  0.078     )
							(-0.05542835  0.01009848  0.078     )
							(-0.05123051  0.00944967  0.078     )
							(-0.04701163  0.00877759  0.078     )
							(-0.04277402  0.0080826   0.078     )
							(-0.03852017  0.00736511  0.078     )
							(-0.03425274  0.00662561  0.078     )
							(-0.02997454  0.00586467  0.078     )
							(-0.02568858  0.00508291  0.078     )

						)
		spline 5 37 (
							(-0.29988723 -0.00077516  0.078     )
							(-0.29955884 -0.00152527  0.078     )
							(-0.29902916 -0.00225135  0.078     )
							(-0.29831185 -0.00295437  0.078     )
							(-0.29741992 -0.00363524  0.078     )
							(-0.29636574 -0.00429481  0.078     )
							(-0.29516105 -0.00493389  0.078     )
							(-0.293817   -0.00555323  0.078     )
							(-0.29234414 -0.00615354  0.078     )
							(-0.29075244 -0.00673546  0.078     )
							(-0.28905134 -0.00729959  0.078     )
							(-0.28724971 -0.00784648  0.078     )
							(-0.28535593 -0.00837664  0.078     )
							(-0.28337783 -0.00889052  0.078     )
							(-0.28132278 -0.00938853  0.078     )
							(-0.27919768 -0.00987104  0.078     )
							(-0.27700893 -0.01033836  0.078     )
							(-0.27476252 -0.01079078  0.078     )
							(-0.272464   -0.01122852  0.078     )
							(-0.27011848 -0.01165178  0.078     )
							(-0.26773071 -0.01206072  0.078     )
							(-0.26530502 -0.01245545  0.078     )
							(-0.26284538 -0.01283606  0.078     )
							(-0.2603554  -0.01320258  0.078     )
							(-0.25783834 -0.01355504  0.078     )
							(-0.25529714 -0.0138934   0.078     )
							(-0.2527344  -0.01421763  0.078     )
							(-0.25015244 -0.01452763  0.078     )
							(-0.24755327 -0.01482331  0.078     )
							(-0.24493865 -0.01510452  0.078     )
							(-0.24231004 -0.01537111  0.078     )
							(-0.23966866 -0.0156229   0.078     )
							(-0.23701551 -0.0158597   0.078     )
							(-0.23435133 -0.01608127  0.078     )
							(-0.23167667 -0.01628739  0.078     )
							(-0.22899186 -0.01647781  0.078     )
							(-0.22629705 -0.01665226  0.078     )
							(-0.2235922  -0.01681048  0.078     )
							(-0.22087712 -0.01695219  0.078     )
							(-0.21815143 -0.01707709  0.078     )
							(-0.21541465 -0.0171849   0.078     )
							(-0.21266611 -0.01727532  0.078     )
							(-0.20990507 -0.01734807  0.078     )
							(-0.20713064 -0.01740286  0.078     )
							(-0.20434184 -0.01743941  0.078     )
							(-0.2015376  -0.01745744  0.078     )
							(-0.19871675 -0.01745669  0.078     )
							(-0.19587808 -0.01743691  0.078     )
							(-0.19302028 -0.01739786  0.078     )
							(-0.19014201 -0.01733933  0.078     )
							(-0.18724188 -0.01726113  0.078     )
							(-0.18431846 -0.01716308  0.078     )
							(-0.18137031 -0.01704504  0.078     )
							(-0.17839596 -0.0169069   0.078     )
							(-0.17539392 -0.01674857  0.078     )
							(-0.17236273 -0.01657     0.078     )
							(-0.16930092 -0.0163712   0.078     )
							(-0.16620703 -0.01615218  0.078     )
							(-0.16307965 -0.01591304  0.078     )
							(-0.15991738 -0.01565389  0.078     )
							(-0.15671888 -0.01537491  0.078     )
							(-0.15348283 -0.01507633  0.078     )
							(-0.15020798 -0.01475844  0.078     )
							(-0.14689317 -0.01442158  0.078     )
							(-0.14353726 -0.01406618  0.078     )
							(-0.14013922 -0.0136927   0.078     )
							(-0.13669809 -0.01330171  0.078     )
							(-0.133213   -0.01289382  0.078     )
							(-0.12968319 -0.01246973  0.078     )
							(-0.12610798 -0.01203025  0.078     )
							(-0.1224868  -0.01157622  0.078     )
							(-0.11881922 -0.01110862  0.078     )
							(-0.1151049  -0.01062849  0.078     )
							(-0.11134363 -0.01013699  0.078     )
							(-0.10753535 -0.00963536  0.078     )
							(-0.1036801  -0.00912496  0.078     )
							(-0.09977809 -0.00860724  0.078     )
							(-0.09582965 -0.00808379  0.078     )
							(-0.09183529 -0.00755629  0.078     )
							(-0.08779565 -0.00702656  0.078     )
							(-0.08371153 -0.00649652  0.078     )
							(-0.07958389 -0.00596825  0.078     )
							(-0.07541387 -0.00544394  0.078     )
							(-0.07120275 -0.00492593  0.078     )

						)
);

boundary
(
    down
    {
        type patch;
        faces
        (
            ( 2 14 15  3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (14 10 11 15)
        );
    }
    up
    {
        type patch;
        faces
        (
            (10  8  9 11)
        );
    }
    meanFlow
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (24 22 23 25)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (30 32 33 31)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
        );
    }


);
